# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'php'
brew 'php@7.4'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'clockify'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flux'
#cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'kaleidoscope'
cask 'keepingyouawake'
cask 'keka'
cask 'keybase'
#cask 'gpg-suite'
cask 'microsoft-teams'
cask 'mongodb-compass'
cask 'pastebot'
cask 'paw'
cask 'slack'
cask 'superduper'
cask 'transmit'
cask 'tunnelblick'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Clocker', id: 1056643111
mas 'NordVPN IKE', id: 1116599239
mas 'iA Writer', id: 775737590
mas 'DaisyDisk', id: 411643860
mas 'Affinity Photo', id: 824183456
mas 'Medis', id: 1063631769
